null/xdslog/sentMessages/2015/5/13/sent_ProvideAndRegisterDocumentSet-b_null#94daea97-b785-4705-89d2-8a17ea6a14aa.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:94daea97-b785-4705-89d2-8a17ea6a14aa</MessageID>
</S:Header>
<S:Body>
<ns4:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns3:SubmitObjectsRequest>
<RegistryObjectList>
<ExtrinsicObject id="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20150504</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Perez^May</Value>
<Value>PID-7|19910606</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Immunization History"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:e7a162eb-97db-4e7b-a93b-74c5085e7f6c" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:7e254a82-2ac0-4750-9a07-50daeff376e4" nodeRepresentation="Outpatient Care">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Outpatient Care"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:2876438f-9074-41bc-ade6-a70f3875fb26" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:e84e7c3f-bc97-4242-ad83-276e9b180022" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.101">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon confidentialityCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:b2053986-e2e5-4ed6-8c7d-84e75f7644ec" nodeRepresentation="urn:ihe:pcc:aps:2007">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="urn:ihe:pcc:aps:2007"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:e4e6d699-ad67-49db-a822-9aff020c6cde" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" id="urn:uuid:e47c6e0f-5c90-41bf-8327-1f340f2b291b" nodeRepresentation="PC">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Primary Care Clinic"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:bb9f1219-ab19-4bed-965a-e1b650af7b42" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:1c6d9b8a-7ef3-4888-9de3-523d9205f3eb" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3" value="2.16.840.1.113883.3.72.5.9.1.0.5386503746189417839111111111">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<RegistryPackage id="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b">
<Slot name="submissionTime">
<ValueList>
<Value>20150504110603</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="SMS Gateway Package"/>
</Name>
<Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" id="urn:uuid:ef661233-1663-4cf2-abf7-69ca98d69f51" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" id="urn:uuid:b20d641b-cc28-4633-9de9-cdee3d9a285b" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:2b9ed880-726d-41a4-8c62-48b967015f42" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSSubmissionSet.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:5b8d6c44-1a09-4d80-b507-7ff6ac36fc86" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" value="2.16.840.1.113883.3.72.5.9.1.1.5549314503791303209111111111">
<Name>
<LocalizedString value="XDSSubmissionSet.uniqueId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:55224a69-3f1c-4b56-a05f-4108d31fc523" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" value="2.16.840.1.113883.3.72.5.9.1.2.5190328671848149170">
<Name>
<LocalizedString value="XDSSubmissionSet.sourceId"/>
</Name>
</ExternalIdentifier>
</RegistryPackage>
<Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" id="urn:uuid:fd24bfb8-3472-4c93-b180-b38d3a34ddb0"/>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:4dd9ca28-368d-478e-9533-4b17776af16b" sourceObject="urn:uuid:a3c35ed6-c5fd-4d1d-8b79-031d18d1ff5b" targetObject="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
</RegistryObjectList>
</ns3:SubmitObjectsRequest>
<ns4:Document id="urn:uuid:03ad5623-e673-4554-92cb-98919258c3f3">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:f390efa9-60ee-4912-9770-b7558684b158"/>
</ns4:Document>
</ns4:ProvideAndRegisterDocumentSetRequest>
</S:Body>
</S:Envelope>
